# IsElementFullySupported Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsElementFullySupported Method
AnalyticalModel Class See Also
---
Indicates if Analytical Model is fully supported.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsElementFullySupported()
```

Visual Basic
---
```text
Public Function IsElementFullySupported As Boolean
```

Visual C++
---
```text
public:
bool IsElementFullySupported()
```

# ### Return Value
True if Analytical Model is fully supported, false otherwise.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace